define(function(require, exports, module) {
	var source = {
		"sourceData1": {//单一对象对应不同属性的情况
			"describe": "淘宝日志一级标签统计",
			"title":"淘宝日志一级标签统计结果",
			"objects": ["商品操作行为","信息管理","栏目与活动","其他","搜索与分类","首页与登录"],
			"property": [['属性值']],
			"relationtype":1,//1 yiwei 2 2wei  3 duowei 4 shijian 5 cengci 5 wangluo 7 map 8 zi
			"relations":{
				"商品操作行为":[[2495]],
				"信息管理":[[3324]],
				"栏目与活动":[[57368]],
				"其他":[[1865]],
				"搜索与分类":[[2630]],
				"首页与登录":[[2475]]
			}
		},
		"sourceData2": {//多对象对应不同属性的情况
			"describe": "淘宝日志二级标签统计",
			"title": "淘宝日志二级标签统计结果",
			"objects": ["商品操作行为","信息管理","栏目与活动","其他","搜索与分类","首页与登录"],
			"property": [
						['属性','属性值']
					 ],
			"relationtype":2,
			"relations":{
				"商品操作行为":[
						["购买", 2495],
						["评论", 3324],
						["浏览", 57368],
						["店铺浏览",1865],
						["购物车",2630],
						["收藏",2475]
					],
				"信息管理":[
						["卖家中心", 3716],
						["上传", 1224],
						["物流", 2672],
						["已买到宝贝",19643]
						],
				"栏目与活动":[
						["淘金币", 25981],
						["手机端",1449],
						["爱淘宝", 6077],
						["聚划算",5611],
						["广告", 1218],
						["淘宝试用",14554],
						["分销",4637],
						["论坛",1350],
						["淘宝热卖",913],
						["会员",869]
				],
				"其他": [["其他",955]],
				"搜索与分类":[
							["列表页",4826],
							["筛选",22016],
							["爱淘搜索",1822]
							],
				"首页与登录":[
							["首页",8701],
							["登录",18037]
							]
			}
		},
		"sourceData21": {//多对象对应相同属性的情况
			"describe": "基于省份对收入的统计",
			"title": "基于省份对收入的统计",
			"objects": ["3000元以下","3001～5000元","5001～8000元","8001～12000元","12000元以上"],
			"property": [
						['北京','上海','重庆','新疆','广东','天津','海南','吉林','四川','湖南','河南','河北']
					 ],
			"relationtype":2,
			"relations":{
				"3000元以下":[["北京",2495],
							["上海",3324],
							["重庆",57368],
							["新疆",1865],
							["广东",2630],
							["天津",2475],
							["海南",2495],
							["吉林",3324],
							["四川",57368],
							["湖南",1865],
							["河南",2630],
							["河北",2475]],
				"3001～5000元":[
							["北京",2095],
							["上海",5324],
							["重庆",5368],
							["新疆",1865],
							["广东",7630],
							["天津",9475],
							["海南",10495],
							["吉林",3724],
							["四川",5368],
							["湖南",2865],
							["河南",8630],
							["河北",9475]],
				"5001～8000元":[
							["北京",9495],
							["上海",7324],
							["重庆",7368],
							["新疆",2865],
							["广东",6730],
							["天津",8975],
							["海南",12295],
							["吉林",3454],
							["四川",5368],
							["湖南",6865],
							["河南",4630],
							["河北",7475]],
				"8001～12000元":[
							["北京",5495],
							["上海",6324],
							["重庆",3368],
							["新疆",865],
							["广东",9630],
							["天津",5475],
							["海南",7495],
							["吉林",8324],
							["四川",7368],
							["湖南",3865],
							["河南",5630],
							["河北",6475]
							],
				"12000元以上":[
				["北京",2495],
							["上海",3324],
							["重庆",368],
							["新疆",1865],
							["广东",2630],
							["天津",2475],
							["海南",2495],
							["吉林",3324],
							["四川",3368],
							["湖南",1865],
							["河南",2630],
							["河北",2475]]
			}
		},
		"sourceData3": {//d多维属性的情况
			"describe": "城市PM2.5统计（多维）",
			"title": "城市PM2.5统计（多维）",
			"objects": ["北京","上海","广州"],
			"property": [
						["日期","PM2.5","等级"]
					 ],
			"relationtype":3,
			"relations":{
				"北京":[		[1,3324,0.9],
								[2,1234,0.3],
								[3,7654,0.5],
								[4,789,0.1],
								[5,2341,0.2],
								[6,566,0.9]
						],
				"上海":[		[1,765,0.9],
								[2,432,0.3],
								[3,3456,0.5],
								[4,7888,0.1],
								[5,4332,0.2],
								[6,2334,0.9]
						],
				"广州":[
								[1,123,0.9],
								[2,234,0.3],
								[3,231,0.5],
								[4,321,0.1],
								[5,231,0.2],
								[6,3324,0.9]
						]
				
			}
		},
		"sourceData4": {//具有时间属性的数据
			"describe": "时间示例数据",
			"title": "时间示例数据",
			"objects": ["北京","上海","广州"],
			"property": [
						["时间","数量"]
					 ],
			"relationtype":4,
			"relations":{
				"北京":[		[1,3324],
							[2,1234],
							[3,7654],
							[4,789],
							[5,2341],
							[6,566]
						],
				"上海":[		[1,765],
							[2,432],
							[3,3456],
							[4,7888],
							[5,4332],
							[6,2334]
						],
				"广州":[
							[1,123],
							[2,234],
							[3,231],
							[4,321],
							[5,231],
							[6,3324]
						]
				
			}
		},
		"sourceData5":{//层次节点
            "describe": "层次节点示例",
            "title": "层次节点视频网站标签分类",
            'relationtype':5,
            'relations':{
                'name': '视频网站',
                'children': [
                    {
                        'name': "爱奇艺",
                        'children': [
                            {'name': "电视剧",'children':null},
                            {'name': "电影",'children':null},
                            {'name': "综艺",'children':null},
                            {'name': "动漫",'children':null}
                        ]
                    },
                    {
                        'name': "腾讯视频",
                        'children': [
                            {'name': "电视剧",'children':null},
                            {'name': "电影",'children':null},
                            {'name': "综艺",'children':null},
                            {'name': "动漫",'children':null}
                        ]
                    },
                    {
                        'name': "乐视",
                        'children': [
                            {'name': "电视剧",'children':null},
                            {'name': "电影",'children':null},
                            {'name': "综艺",'children':null},
                            {'name': "动漫",'children':null}
                        ]
                    }]	
            }
                
            
        },
        "sourceData6": {//网络节点
            "describe": "网络节点示例",
            "title": "网络节点视频网站标签分类",
            "objects": ["视频", "爱奇艺", "乐视", "搜狐视频", "腾讯视频", "电视剧", "电影", "综艺", "动漫"],
            'relationtype':6,
            'relations':[		
                                {'source': "爱奇艺", 'target': ["电视剧", "电影", "综艺", "动漫"]},
                                {'source': "乐视", 'target': [ "电影", "综艺", "动漫"]},
                                {'source': "搜狐视频", 'target': [ "视频", "综艺", "动漫"]},
                                {'source': "腾讯视频", 'target': [ "电影", "综艺", "动漫"]},
                                
                        ]
                
            },
        "sourceData7": {//地图
			"describe": "地理位置统计",
			"title": "地理位置统计",
			"objects": ["3000以下","3001-5000","5001-8000",'8001-12000','12000以上'],
			"property": [
						["地区","value"]
					 ],
			"relationtype":7,
			"relations":{
				"3000以下":[		
								['北京',35],
								[ "天津", 15],
		            			[ "河北", 23],
		            			[ "山西", 11],
		            			[ "内蒙古", 10],
		            			[ "辽宁", 17],
		            			[ "吉林", 12],
		            			[ "黑龙江", 15],
		            			[ "上海", 43],
		            			[ "江苏", 55],
		            			[ "浙江", 42],
		            			[ "安徽", 15],
		            			[ "福建", 17],
		            			[ "江西", 19],
		            			[ "山东", 49],
		            			[ "河南", 38],
		            			[ "湖北", 22]
						],
				"3001-5000":[		
								['北京',18],
								[ "天津", 3],
		            			[ "河北", 10],
		            			[ "山西", 1],
		            			[ "内蒙古", 3],
		            			[ "辽宁", 8],
		            			[ "吉林", 4],
		            			[ "黑龙江", 6],
		            			[ "上海", 24],
		            			[ "江苏", 27],
		            			[ "浙江", 15],
		            			[ "安徽", 5],
		            			[ "福建", 14],
		            			[ "江西", 2],
		            			[ "山东", 22],
		            			[ "河南", 9],
		            			[ "湖北", 5]
						],
				"5001-8000":[
								['北京',12],
								[ "天津", 3],
		            			[ "河北", 0],
		            			[ "山西", 1],
		            			[ "内蒙古", 1],
		            			[ "辽宁", 2],
		            			[ "吉林", 1],
		            			[ "黑龙江", 1],
		            			[ "上海", 10],
		            			[ "江苏", 8],
		            			[ "浙江", 6],
		            			[ "安徽", 2],
		            			[ "福建", 6],
		            			[ "江西", 2],
		            			[ "山东", 6],
		            			[ "河南", 3],
		            			[ "湖北", 1]
						],
				"8001-12000":[
								['北京',5],
								[ "天津", 3],
		            			[ "河北", 0],
		            			[ "山西", 0],
		            			[ "内蒙古", 0],
		            			[ "辽宁", 0],
		            			[ "吉林", 0],
		            			[ "黑龙江", 1],
		            			[ "上海", 8],
		            			[ "江苏", 7],
		            			[ "浙江", 4],
		            			[ "安徽", 1],
		            			[ "福建", 0],
		            			[ "江西", 1],
		            			[ "山东", 1],
		            			[ "河南", 0],
		            			[ "湖北", 0]
						],
				"12000以上":[
								['北京',2],
								[ "天津", 3],
		            			[ "河北", 1],
		            			[ "山西", 0],
		            			[ "内蒙古", 0],
		            			[ "辽宁", 0],
		            			[ "吉林", 0],
		            			[ "黑龙江", 0],
		            			[ "上海", 3],
		            			[ "江苏", 6],
		            			[ "浙江", 0],
		            			[ "安徽", 1],
		            			[ "福建", 4],
		            			[ "江西", 0],
		            			[ "山东", 4],
		            			[ "河南", 1],
		            			[ "湖北", 0]
						]
				
			}
		},
        "sourceData8": {//文本标签
			"describe": "文本标签字统计",
			"title": "文本标签字统计",
			"objects": ["标签"],
			"property": [
						["word","value"]
					 ],
			"relationtype":8,
			"relations":{
				"标签":[		['Name',33],
							['Egg',12],
							['Color',7],
							['Sit',9],
							['Coming',21],
							['Hello',26],
							['AAA',33],
							['Test',12],
							['Python',76],
							['Hello',7],
							['CSS',21],
							['JSON',50]
						]
				
			}
		}
	};
	module.exports = source;
});





